ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/MMCSD1_SS_CFG.xml
<module name="MMCSD1_SS_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="REGS__SS_CFG__SSCFG_SS_ID_REV_REG" acronym="REGS__SS_CFG__SSCFG_SS_ID_REV_REG" offset="0x0" width="32" description="The Subsystem ID and Revision Register contains the module ID, major, and minor revisions for the subsystem">
		<bitfield id="MOD_ID" width="16" begin="31" end="16" resetval="0x26688" description="Module ID" range="31 - 16" rwaccess="R"/> 
		<bitfield id="RTL_VER" width="5" begin="15" end="11" resetval="0x6" description="RTL version" range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJ_REV" width="3" begin="10" end="8" resetval="0x2" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MIN_REV" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_1_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_1_REG" offset="0x10" width="32" description="The Controller Config 1 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2.">
		<bitfield id="TUNINGCOUNT" width="6" begin="29" end="24" resetval="0x32" description="Configures the Number of Taps (Phases) of the RX clock that is supported. The Tuning State machine uses this information to select one of the Taps (Phases) of the RX clock during the Tuning Procedure." range="29 - 24" rwaccess="R/W"/> 
		<bitfield id="ASYNCWKUPENA" width="1" begin="20" end="20" resetval="0x1" description="Determines the Wakeup Signal Generation Mode. 0: Synchronous Wakeup Mode: The xin_clk has to be running for this mode. The Card Insertion/Removal/Interrupt events are detected synchronously on the xin_clk and the Wakeup Event is generated. The Assertion and deassertion of the wakeup Event signal synchronous to xin_clk. 1: Asyncrhonous Wakeup Mode: The xin_clk and the host_clk can be stopped in this mode and the Wake up Event is asynchronously generated based on the Card Insertion/Removal/Interrupt Events. The Assertion and deassertion of the wakeup Event signal is asynchronous." range="20" rwaccess="R/W"/> 
		<bitfield id="CQFMUL" width="4" begin="15" end="12" resetval="0x3" description="FMUL for the CQ Internal Timer Clock Frequency" range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="CQFVAL" width="10" begin="9" end="0" resetval="0x200" description="FVAL for the CQ Internal Timer Clock Frequency" range="9 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_CTL_CFG_2_REG" acronym="REGS__SS_CFG__SSCFG_CTL_CFG_2_REG" offset="0x14" width="32" description="The Controller Config 2 Register contains various fields to control the configuration ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller configuration ports please refer to its specification listed in Section 1.2. This register sets the lsb fields in the Capabilities Register inside the Arasan eMMC/SD Controller.">
		<bitfield id="SLOTTYPE" width="2" begin="31" end="30" resetval="0x0" description="Slot Type. Should be set based on the final product usage. 00 - Removable SCard Slot, 01 - Embedded Slot for One Device, 10 - Shared Bus Slot, 11 - Reserved." range="31 - 30" rwaccess="R/W"/> 
		<bitfield id="ASYNCHINTRSUPPORT" width="1" begin="29" end="29" resetval="0x1" description="Asynchronous Interrupt Support. Suggested Value is 1'b1 (The Core supports monitoring of Asynchronous Interrupt)." range="29" rwaccess="R/W"/> 
		<bitfield id="SUPPORT1P8VOLT" width="1" begin="26" end="26" resetval="0x1" description="1.8V Support. Suggested Value is 1'b1 (The 1.8 Volt Switching is supported by Core). Optionally can be set to 1'b0 if the application doesn't want 1.8V switching (SD3.0)." range="26" rwaccess="R/W"/> 
		<bitfield id="SUPPORT3P0VOLT" width="1" begin="25" end="25" resetval="0x1" description="3.0V Support. Should be set based on whether 3.0V is supported on the SD Interface." range="25" rwaccess="R/W"/> 
		<bitfield id="SUPPORT3P3VOLT" width="1" begin="24" end="24" resetval="0x1" description="3.3V Support. Suggested Value is 1'b1 as the 3.3 V is the default voltage on the SD Interface." range="24" rwaccess="R/W"/> 
		<bitfield id="SUSPRESSUPPORT" width="1" begin="23" end="23" resetval="0x1" description="Suspend/Resume Support. Suggested Value is 1'b1 (The Suspend/Resume is supported by Core). Optionally can be set to 1'b0 if the application doesn't want to support Suspend/Resume Mode." range="23" rwaccess="R/W"/> 
		<bitfield id="SDMASUPPORT" width="1" begin="22" end="22" resetval="0x1" description="SDMA Support. Suggested Value is 1'b1 (The SDMA is supported by Core). Optionally can be set to 1'b0 if the application doesn't want to support SDMA Mode." range="22" rwaccess="R/W"/> 
		<bitfield id="HIGHSPEEDSUPPORT" width="1" begin="21" end="21" resetval="0x1" description="High Speed Support. Suggested Value is 1'b1 (The High Speed mode is supported by Core)." range="21" rwaccess="R/W"/> 
		<bitfield id="ADMA2SUPPORT" width="1" begin="19" end="19" resetval="0x1" description="ADMA2 Support. Suggested Value is 1'b1 (The ADMA2 is supported by Core). Optionally can be set to 1'b0 if the application doesn't want to support ADMA2 Mode." range="19" rwaccess="R/W"/> 
		<bitfield id="SUPPORT8BIT" width="1" begin="18" end="18" resetval="0x0" description="8-bit Support for Embedded Device. Suggested Value is 1'b1 (The Core supports 8-bit Interface). Optionally an be set to 1'b0 if the Application supports only 4-bit SD Interface." range="18" rwaccess="R/W"/> 
		<bitfield id="MAXBLKLENGTH" width="2" begin="17" end="16" resetval="0x0" description="Max Block Length. Maximum Block Length supported by the Core/Device. 00: 512 (Bytes), 01: 1024, 10: 2048, 11: Reserved." range="17 - 16" rwaccess="R/W"/> 
		<bitfield id="BASECLKFREQ" width="8" begin="15" end="8" resetval="0x200" description="Base Clock Frequency for SD Clock. This is the frequency of the xin_clk." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TIMEOUTCLKUNIT" width="1" begin="7" end="7" resetval="0x0" description="Timeout Clock Unit. Suggested Value is 1'b0 (KHz)." range="7" rwaccess="R/W"/> 
		<bitfield id="TIMEOUTCLKFREQ" width="6" begin="5" end="0" resetval="0x1" description="Timeout Clock Frequency. Suggested Value is 1 KHz. Internally the 1msec Timer is used for Timeout Detection. The 1msec Timer is generated from the xin_clk." range="5 - 0" rwaccess="R/W"/>
	</register>
