ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/MMCSD1_SS_CFG.xml
	<register id="REGS__SS_CFG__SSCFG_CTL_STAT_6_REG" acronym="REGS__SS_CFG__SSCFG_CTL_STAT_6_REG" offset="0x74" width="32" description="The Controller Status 6 Register contains various fields to reflect the status of the debug ports on the Arasan eMMC/SD Controller. For detailed functionality of the Arasan eMMC/SD Controller debug ports please refer to its specification listed in Section 1.2.">
		<bitfield id="TUNDEBUGBUS" width="16" begin="15" end="0" resetval="0x0" description="TUN_CTRL Debug Bus." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_1_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_1_REG" offset="0x100" width="32" description="The PHY Control 1 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="IOMUX_ENABLE" width="1" begin="31" end="31" resetval="0x1" description="IO mux enable. Set 1 for GPIO. Set 0 for eMMC/SD" range="31" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_2_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_2_REG" offset="0x104" width="32" description="The PHY Control 2 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_3_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_3_REG" offset="0x108" width="32" description="The PHY Control 3 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_4_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_4_REG" offset="0x10C" width="32" description="The PHY Control 4 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="OTAPDLYENA" width="1" begin="20" end="20" resetval="0x0" description="Output Tap Delay Enable. Enables manual control of the TX clock tap delay, for clocking the final stage flops for maintaining Hold requirements on EMMC Interface." range="20" rwaccess="R/W"/> 
		<bitfield id="OTAPDLYSEL" width="4" begin="15" end="12" resetval="0x0" description="Output Tap Delay Select. Manual control of the TX clock tap delay for clocking the final stage flops for maintaining Hold requirements on EMMC Interface." range="15 - 12" rwaccess="R/W"/> 
		<bitfield id="ITAPCHGWIN" width="1" begin="9" end="9" resetval="0x0" description="Input Tap Change Window. It gets asserted by the controller while changing the itapdlysel. Used to gate of the RX clock during switching the clock source while tap is changing to avoid clock glitches." range="9" rwaccess="R/W"/> 
		<bitfield id="ITAPDLYENA" width="1" begin="8" end="8" resetval="0x0" description="Input Tap Delay Enable. This is used for the manual control of the RX clock Tap Delay in non HS200/HS400 modes." range="8" rwaccess="R/W"/> 
		<bitfield id="ITAPDLYSEL" width="5" begin="4" end="0" resetval="0x0" description="Input Tap Delay Select. Manual control of the RX clock Tap Delay in the non HS200/HS400 modes." range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_5_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_5_REG" offset="0x110" width="32" description="The PHY Control 5 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		<bitfield id="CLKBUFSEL" width="3" begin="2" end="0" resetval="0x0" description="Clock Delay Buffer Select. Selects one of the eight taps in the CLK Delay Buffer based on PVT variation." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_CTRL_6_REG" acronym="REGS__SS_CFG__SSCFG_PHY_CTRL_6_REG" offset="0x114" width="32" description="The PHY Control 6 Register contains various fields to control the ports on the Arasan eMMC/SD PHY. For detailed functionality of the Arasan eMMC/SD PHY control ports please refer to its specification listed in Section 1.2.">
		
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_STAT_1_REG" acronym="REGS__SS_CFG__SSCFG_PHY_STAT_1_REG" offset="0x130" width="32" description="The PHY Status 1 Register contains various fields to reflect the status of the Arasan eMMC/SD PHY ports. For detailed functionality of the Arasan eMMC/SD PHY status ports please refer to its specification listed in Section 1.2.">
		
	</register>
	<register id="REGS__SS_CFG__SSCFG_PHY_STAT_2_REG" acronym="REGS__SS_CFG__SSCFG_PHY_STAT_2_REG" offset="0x134" width="32" description="The PHY Status 2 Register contains various fields to reflect the status of the Arasan eMMC/SD PHY ports. For detailed functionality of the Arasan eMMC/SD PHY status ports please refer to its specification listed in Section 1.2.">
		
	</register>
</module>